app/controllers/questions_controller.rb

SELECT * FROM "questions"
---
  def index
    @questions = Question.all

SELECT * FROM "questions" WHERE ("questions"."id" = 769459213)
---
  def show
    @question = Question.find(params[:id])

INSERT INTO "questions" ("name", "created_at", "updated_at", "answer_id") VALUES('i love hummus!', '2009-10-30 23:59:12', '2009-10-30 23:59:12', NULL)
---
  def create
    @question = Question.new(params[:question])
    if @question.save